# CreateCreasesFromFoldingLines Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeEditor..::..CreateCreasesFromFoldingLines Method
SlabShapeEditor Class See Also
---
Convert selected folding lines to split lines
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public void CreateCreasesFromFoldingLines(
	Element hostObj,
	IList<Reference> references
)
```

Visual Basic
---
```text
Public Sub CreateCreasesFromFoldingLines ( _
	hostObj As Element, _
	references As IList(Of Reference) _
)
```

Visual C++
---
```text
public:
void CreateCreasesFromFoldingLines(
	Element^ hostObj,
	IList<Reference^>^ references
)
```

# ### Parameters
hostObj
    Type: Autodesk.Revit.DB..::..Element object that hosts the SlabShapeEditor
references
    Type: System.Collections.Generic..::..IList<(Of <(<'Reference>)>)> References of selected folding lines.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | this operation failed. |

# See Also
SlabShapeEditor Class
Autodesk.Revit.DB Namespace